In [36]:
import pandas as pd

cardio_base = pd.read_csv("cardio_base.csv")
cardio_alco=pd.read_csv("cardio_alco.csv")

In [37]:
cardio_base

          id    age  gender  height  weight  ap_hi  ap_lo  cholesterol  smoke
0          0  18393       2     168    62.0    110     80            1      0
1          1  20228       1     156    85.0    140     90            3      0
2          2  18857       1     165    64.0    130     70            3      0
3          3  17623       2     169    82.0    150    100            1      0
4          4  17474       1     156    56.0    100     60            1      0
...      ...    ...     ...     ...     ...    ...    ...          ...    ...
69995  99993  19240       2     168    76.0    120     80            1      1
69996  99995  22601       1     158   126.0    140     90            2      0
69997  99996  19066       2     183   105.0    180     90            3      0
69998  99998  22431       1     163    72.0    135     80            1      0
69999  99999  20540       1     170    72.0    120     80            2      0

[70000 rows x 9 columns]

In [38]:
cardio_base.dtypes

id               int64
age              int64
gender           int64
height           int64
weight         float64
ap_hi            int64
ap_lo            int64
cholesterol      int64
smoke            int64
dtype: object

In [39]:
cardio_base['age'] = cardio_base['age']/365
cardio_base

,id,age,gender,height,weight,ap_hi,ap_lo,cholesterol,smoke
0,0,50.391781,2,168,62.0,110,80,1,0
1,1,55.419178,1,156,85.0,140,90,3,0
2,2,51.663014,1,165,64.0,130,70,3,0
3,3,48.282192,2,169,82.0,150,100,1,0
4,4,47.873973,1,156,56.0,100,60,1,0
...,...,...,...,...,...,...,...,...,...
69995,99993,52.712329,2,168,76.0,120,80,1,1
69996,99995,61.920548,1,158,126.0,140,90,2,0
69997,99996,52.235616,2,183,105.0,180,90,3,0
69998,99998,61.454795,1,163,72.0,135,80,1,0
69999,99999,56.273973,1,170,72.0,120,80,2,0

In [29]:
cardio_base.dtypes

id               int64
age            float64
gender           int64
height           int64
weight         float64
ap_hi            int64
ap_lo            int64
cholesterol      int64
smoke            int64
dtype: object

In [40]:
cardio_base['age'] = cardio_base['age'].astype(int)
cardio_base

          id  age  gender  height  weight  ap_hi  ap_lo  cholesterol  smoke
0          0   50       2     168    62.0    110     80            1      0
1          1   55       1     156    85.0    140     90            3      0
2          2   51       1     165    64.0    130     70            3      0
3          3   48       2     169    82.0    150    100            1      0
4          4   47       1     156    56.0    100     60            1      0
...      ...  ...     ...     ...     ...    ...    ...          ...    ...
69995  99993   52       2     168    76.0    120     80            1      1
69996  99995   61       1     158   126.0    140     90            2      0
69997  99996   52       2     183   105.0    180     90            3      0
69998  99998   61       1     163    72.0    135     80            1      0
69999  99999   56       1     170    72.0    120     80            2      0

[70000 rows x 9 columns]

In [32]:
cardio_base.dtypes

id             int64
age            int32
gender         int64
height         int64
weight         int32
ap_hi          int64
ap_lo          int64
cholesterol    int64
smoke          int64
dtype: object

In [33]:
cardio_alco

          id  alco
0         44     0
1         45     0
2         46     0
3         47     0
4         49     0
...      ...   ...
56898  99949     0
56899  99950     0
56900  99951     0
56901  99952     0
56902  99954     0

[56903 rows x 2 columns]

In [34]:
cardio_alco.dtypes

id      int64
alco    int64
dtype: object

calculate age as round down how much heavier is the age grp with heaviest average weight than the age grp with the lowest weight using pandas

In [45]:
x=cardio_base.groupby('age')['weight'].mean()
x

age
29    70.000000
30    59.000000
39    72.291573
40    70.914920
41    72.895849
42    71.681523
43    73.983161
44    72.731044
45    74.369430
46    72.717292
47    74.695753
48    74.163059
49    73.929353
50    73.065081
51    75.098530
52    73.432174
53    74.641262
54    73.982996
55    75.266728
56    74.268755
57    75.122789
58    74.619009
59    75.355207
60    74.004312
61    75.707111
62    74.047713
63    75.873721
64    74.619113
Name: weight, dtype: float64

In [50]:
print(x.max())

75.87372076023392

In [51]:
print(x.min())

59.0

In [52]:
x.max()-x.min()

16.873720760233923

do people over 50 age have higher cholestrol  levels than rest how to find

In [59]:
cardio_base.cholesterol.unique()

array([1, 3, 2], dtype=int64)

In [60]:
y=cardio_base.filter(['age','cholesterol'])
y

       age  cholesterol
0       50            1
1       55            3
2       51            3
3       48            1
4       47            1
...    ...          ...
69995   52            1
69996   61            2
69997   52            3
69998   61            1
69999   56            2

[70000 rows x 2 columns]

In [65]:
y_under_50=cardio_base[cardio_base['age']<50].mean()
y_under_50

id             49763.222897
age               44.478023
gender             1.378532
height           165.207576
weight            73.292488
ap_hi            125.057126
ap_lo             91.467560
cholesterol        1.243169
smoke              0.107572
dtype: float64

In [64]:
y_above_50=cardio_base[cardio_base['age']>50].mean()
y_above_50

id             50073.536683
age               56.987702
gender             1.338226
height           163.937256
weight            74.717402
ap_hi            130.617212
ap_lo             99.083989
cholesterol        1.431361
smoke              0.079537
dtype: float64

In [ ]:
y_under_50=cardio_base[cardio_base['age']<50]
y_under_50

How many times more likely are men to be smokers compared to women, according to dataset?

how tall are  the tallest 1% of people?

what percentage of people  are more than 2 standard deviation far away from the avg height

find out what percentage of the population over 50 years old consume alcohol. ignore those where we have no alcohol consumption

which of the following is true with 95% CI smokers have higher blood pressure than non-smokers, men have blood pressure than women, smoker have higher cholestrol level than non-smokers, smokers weight less than non-smokers